In [1]:
from utils import SOF_to_df

In [44]:
im="""Attribute    Change
  Person         3
  Salary         2"""
i="""Person      Salary 
John         350
Peter        543
Susan        517
Carl         448"""
df=SOF_to_df(i)
m=SOF_to_df(im)

In [45]:
m

  Attribute Change
1    Person      3
2    Salary      2

In [46]:
m.transpose().to_dict()

{1: {'Attribute': 'Person', 'Change': '3'},
 2: {'Attribute': 'Salary', 'Change': '2'}}

In [51]:
cleaned = pd.DataFrame()

for mapping in list(m.transpose().to_dict().values()):
    cleaned[mapping['Attribute']] = df[mapping['Attribute']].map(
        lambda s: s[: - int(mapping['Change']) ]+ int(mapping['Change']) *'x')

In [52]:
cleaned

  Person Salary
1   Jxxx    3xx
2  Pexxx    5xx
3  Suxxx    5xx
4   Cxxx    4xx

In [8]:
df['Person'].apply(lambda s: s[:-3]+3*'x')

1     Jxxx
2    Pexxx
3    Suxxx
4     Cxxx
Name: Person, dtype: object